package StackAndHeap;

public class Theory {
    /*
    Stack and Heap

    Stack - это область памяти, которая используется для хранения локальных переменных и ссылок на объекты. Так же Stack
    используется для хранения информации о вызовах методов.
    При вызове метода в стек помещается фрейм, который содержит локальные переменные метода. А так же ссылки на объекты,
    которые были переданы в качестве параметров. При возврате из метода фрейм удаляется из стека.
    При удалении ссылки из стека объект остается в куче. При удалении объекта из кучи, он удаляется из памяти.

    Heap - это область памяти, которая используется для хранения объектов.
    Когда мы создаем объект, он помещается в Heap, а ссылка на этот объект помещается в Stack.
    Когда мы используем ссылку, мы получаем доступ к объекту в Heap.
     */

}
